cryptoadvance/specter-diy/ports/esp32p4/boards/WAVESHARE_P4_43/mpconfigboard.h
// Waveshare ESP32-P4-WIFI6-Touch-LCD-4.3-C
//
// Derived from the upstream ESP32_GENERIC_P4 board. The differences that
// matter are all about being an air-gapped signer: no radio, ever.

#define MICROPY_HW_BOARD_NAME "Waveshare ESP32-P4 Touch LCD 4.3-C"
#define MICROPY_HW_MCU_NAME   "ESP32-P4"

// The REPL arrives over the on-board CH343 USB-UART bridge, not native USB.
#define MICROPY_HW_ENABLE_UART_REPL (1)

// No radio. The P4 has none of its own; the companion ESP32-C6 is held in
// reset by p4board.radio_off(). Leaving these off keeps the radio stacks out
// of the firmware entirely rather than merely unused.
#define MICROPY_PY_NETWORK_WLAN (0)
#define MICROPY_PY_BLUETOOTH    (0)
#define MICROPY_PY_ESPNOW       (0)

// microSD on SDMMC. The board wires D0-D3/CLK/CMD to GPIO 39-44; the slot
// answers there (verified by probing with no card inserted). Reading and
// writing an actual card is still unverified -- see
// reports/kern-wave43-no-sdcard.md.
#define MICROPY_PY_MACHINE_SDCARD      (1)
#define MICROPY_HW_SDMMC_LDO_CHAN_ID   (4)
#define MICROPY_HW_SDMMC_DEFAULT_SLOT  (0)
#define MICROPY_HW_SDMMC_DEFAULT_WIDTH (4)

// Fiacao do slot microSD desta placa. Sem estes defines o driver cai no IOMUX
// padrao do slot 0, que nao corresponde a estes pinos -- o controlador sobe,
// responde, e nenhum cartao e encontrado.
//
// Valores de miketlk/specter-bootloader, lcd-4p3/board_config.h. O Kern nao
// expoe SD nesta placa (BSP_CAPS_SDCARD 0), ver
// reports/kern-wave43-no-sdcard.md.
#define MICROPY_HW_SDMMC_CLK (43)
#define MICROPY_HW_SDMMC_CMD (44)
#define MICROPY_HW_SDMMC_D0  (39)
#define MICROPY_HW_SDMMC_D1  (40)
#define MICROPY_HW_SDMMC_D2  (41)
#define MICROPY_HW_SDMMC_D3  (42)

#ifndef USB_SERIAL_JTAG_PACKET_SZ_BYTES
#define USB_SERIAL_JTAG_PACKET_SZ_BYTES (64)
#endif

// O usermod uhashlib registra o modulo `hashlib` e substitui o embutido, que
// so traz md5/sha1/sha256. Bitcoin precisa de sha512 (BIP32 usa HMAC-SHA512) e
// ripemd160 (enderecos). Desligar o embutido evita duas implementacoes
// disputando o mesmo nome.
#define MICROPY_PY_HASHLIB (0)
